# The fillna() function in pandas looks for the following values to replace in a DataFrame or Series:# 
1.) NaN (Not a Number): Represents missing or undefined numerical values.# 
2.) None: Represents missing or undefined non-numeric (object) values.# Â¶
3.) NaT (Not a Time): Represents missing or undefined datetime values.

In [38]:
import pandas as pd
import numpy as np

# Sample data with different types of null values
data = {'Name': ['Alice', 'Bob', 'David', None,'Kevin'],
        'Age': [25, 40, np.nan , 35,79],
        'Score': [85.5, 70.6, np.nan, 92.7,34.5 ],
        'Timestamp': [pd.NaT, '2022-01-02' ,'2022-01-04', '2022-01-04', '2022-01-05']}

df = pd.DataFrame(data)

In [39]:
df

    Name   Age  Score   Timestamp
0  Alice  25.0   85.5         NaT
1    Bob  40.0   70.6  2022-01-02
2  David   NaN    NaN  2022-01-04
3   None  35.0   92.7  2022-01-04
4  Kevin  79.0   34.5  2022-01-05

In [40]:
df = df.dropna(subset='Name')
df

    Name   Age  Score   Timestamp
0  Alice  25.0   85.5         NaT
1    Bob  40.0   70.6  2022-01-02
2  David   NaN    NaN  2022-01-04
4  Kevin  79.0   34.5  2022-01-05

In [41]:
df = df.dropna(subset='Age')
df

    Name   Age  Score   Timestamp
0  Alice  25.0   85.5         NaT
1    Bob  40.0   70.6  2022-01-02
4  Kevin  79.0   34.5  2022-01-05

In [42]:
df = df.dropna(subset='Timestamp')
df

    Name   Age  Score   Timestamp
1    Bob  40.0   70.6  2022-01-02
4  Kevin  79.0   34.5  2022-01-05